as21253679/nrf51822/ble_app_uart_3adc_eeprom/main.c
    // Configure ADC
	if(adc_number==5)
	{
		NRF_ADC->CONFIG     = (ADC_CONFIG_RES_10bit                        << ADC_CONFIG_RES_Pos)     |						//10bit adc_conversion
							  (ADC_CONFIG_INPSEL_AnalogInputOneThirdPrescaling << ADC_CONFIG_INPSEL_Pos)  |					//simulate pin input 1/3v
							  (ADC_CONFIG_REFSEL_VBG    << ADC_CONFIG_REFSEL_Pos)  |										//refer 1.2 voltage
							  (ADC_CONFIG_PSEL_AnalogInput5                  << ADC_CONFIG_PSEL_Pos)    |					//select adc 
							  (ADC_CONFIG_EXTREFSEL_None                  << ADC_CONFIG_EXTREFSEL_Pos);						//without external refer voltage
	}
	else if(adc_number==6)
	{
		NRF_ADC->CONFIG     = (ADC_CONFIG_RES_10bit                        << ADC_CONFIG_RES_Pos)     |						//10bit adc_conversion
							  (ADC_CONFIG_INPSEL_AnalogInputOneThirdPrescaling << ADC_CONFIG_INPSEL_Pos)  |					//simulate pin input 1/3v
							  (ADC_CONFIG_REFSEL_VBG    << ADC_CONFIG_REFSEL_Pos)  |										//refer 1.2 voltage
							  (ADC_CONFIG_PSEL_AnalogInput6                  << ADC_CONFIG_PSEL_Pos)    |					//select adc 
							  (ADC_CONFIG_EXTREFSEL_None                  << ADC_CONFIG_EXTREFSEL_Pos);						//without external refer voltage
	}
	else if(adc_number==7)
	{
		NRF_ADC->CONFIG     = (ADC_CONFIG_RES_10bit                        << ADC_CONFIG_RES_Pos)     |						//10bit adc_conversion
							  (ADC_CONFIG_INPSEL_AnalogInputOneThirdPrescaling << ADC_CONFIG_INPSEL_Pos)  |					//simulate pin input 1/3v
							  (ADC_CONFIG_REFSEL_VBG    << ADC_CONFIG_REFSEL_Pos)  |										//refer 1.2 voltage
							  (ADC_CONFIG_PSEL_AnalogInput7                  << ADC_CONFIG_PSEL_Pos)    |					//select adc 
							  (ADC_CONFIG_EXTREFSEL_None                  << ADC_CONFIG_EXTREFSEL_Pos);						//without external refer voltage
	}
	else
		return 0;
	
	NRF_ADC->INTENSET   = ADC_INTENSET_END_Msk;
    NRF_ADC->EVENTS_END = 0;
    NRF_ADC->ENABLE     = ADC_ENABLE_ENABLE_Enabled;
 
    // Enable ADC interrupt
    err_code = sd_nvic_ClearPendingIRQ(ADC_IRQn);
    APP_ERROR_CHECK(err_code);
 
    err_code = sd_nvic_SetPriority(ADC_IRQn, 3);
    APP_ERROR_CHECK(err_code);
                     
  	err_code =sd_nvic_DisableIRQ(ADC_IRQn);
   // err_code = sd_nvic_EnableIRQ(ADC_IRQn);
    APP_ERROR_CHECK(err_code);
 
    NRF_ADC->EVENTS_END  = 0;    // Stop any running conversions.
    NRF_ADC->TASKS_START = 1;
	while (NRF_ADC->EVENTS_END == 0 || times >200 )
    {
		times ++ ;
	}     
	if(times > 200)
	{
		return 0;
	}
	else
	{
		NRF_ADC->EVENTS_END     = 0;
		adc_result              = NRF_ADC->RESULT;
		NRF_ADC->TASKS_STOP     = 1;
	}
    return adc_result;   
}

/**
 * @brief set adc_pin nopull input. 
 */
static void adc_pin_config(void)
{
	nrf_gpio_cfg_input(4, NRF_GPIO_PIN_NOPULL);
	nrf_gpio_cfg_input(5, NRF_GPIO_PIN_NOPULL);
	nrf_gpio_cfg_input(6, NRF_GPIO_PIN_NOPULL);
}

/**
 * @brief Function for configuring: BUTTON_INPUT pin for input,
 * and configures GPIOTE to give an interrupt on pin change.
 */
static void gpio_init(void)
{
    ret_code_t err_code;

    err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_LOTOHI(true);
    in_config.pull = NRF_GPIO_PIN_PULLDOWN;

	//nrf_gpio_cfg_sense_input(BUTTON_INPUT,NRF_GPIO_PIN_PULLDOWN,NRF_GPIO_PIN_SENSE_HIGH);  //if want to wake up on deep sleep mode
    err_code = nrf_drv_gpiote_in_init(BUTTON_INPUT, &in_config, in_pin_handler);
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_event_enable(BUTTON_INPUT, true);
}


/**@brief Application main function.
 */
int main(void)
{
	int i=0;
	uint8_t adc_string[50]="";
	uint32_t adc_value=0;
	uint8_t adc_H,adc_L;
	uint8_t reg_byte_H=0x00,reg_byte_L=0x00;
	bool max_bit=false;
    uint32_t err_code;
	uint8_t m_data[255]; //Buffer for read EEPROM data. 
	
	adc_pin_config();//adc_pin config
	nrf_gpio_cfg_input(12,NRF_GPIO_PIN_PULLDOWN);  //button config p0.12
	//gpio_init();//p0.12 input interrupt initial
	
	// eeprom init
	twi_init();//i2c init
	//ERASE_EEPROM_data();//earse eeprom
	
    // Initialize ble.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    printf("\r\nUART Start!\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

	/*max_bit=false;reg_byte_H=0x00,reg_byte_L=0x00;
	while(1)
	{
		read_EEPROM_data(0x7a,0x00,max_bit,m_data);//read eeprom data in specific register
		printf("\r\n\r\n0x00\r\n\r\n");
		nrf_delay_ms(500);
		read_EEPROM_data(0x80,0x00,max_bit,m_data);//read eeprom data in specific register
		printf("\r\n\r\n0x55\r\n\r\n");
		nrf_delay_ms(500);
		read_EEPROM_data(0x88,0x00,max_bit,m_data);//read eeprom data in specific register
		printf("\r\n\r\n0xaa\r\n\r\n");
		nrf_delay_ms(500);
	}*/
    /*while(1)
    {
		read_EEPROM_data(reg_byte_H,0x00,max_bit,m_data);//read eeprom data in specific register
		for(i=0;i<12;i++)//send eeprom_data, max_size of ble_send_data is 20byte 
		{
			ble_nus_string_send(&m_nus, &m_data[i*20], 20);//send data through ble uart
			nrf_delay_ms(100);
		}
		if(reg_byte_H==0xFF)//upper_counter for eeprom_address
		{
			if(max_bit==true)
				break;
			max_bit=true;
			reg_byte_H=0x00;
		}
		else
		{
			reg_byte_H+=0x01;
		}
	}*/
	max_bit=false;reg_byte_H=0x00,reg_byte_L=0x00;
	while(1)
	{
		if(!nrf_gpio_pin_read(12))
		{
			//////////////////////////////////////////////////
			adc_value=adc_start(5);//manually trigger adc
			adc_H=adc_value/256;
			adc_L=adc_value%256;
			printf("ADC5:%d \r\n",adc_value);
			sprintf(adc_string,"1:%d\n",adc_value);
			write_EEPROM_data(reg_byte_H,reg_byte_L,adc_H,adc_L,max_bit);//write data to eeprom
			if(reg_byte_H==0xFF)//upper_counter for eeprom_address
			{
				if(max_bit==true)
					break;
				max_bit=true;
				reg_byte_H=0x00;
				reg_byte_L=0x00;
			}
			else
			{
				if(reg_byte_L==0xFE)
				{
					reg_byte_H+=0x01;
					reg_byte_L=0x00;
				}
				else
				{
					reg_byte_L+=0x02;
				}
			}
			nrf_delay_ms(5);
			//////////////////////////////////////////////////
			/*adc_value=adc_start(6);//manually trigger adc
			adc_H=adc_value/256;
			adc_L=adc_value%256;
			printf("ADC6:%d \r\n",adc_value);
			sprintf(adc_string,"2:%d\n",adc_value);
			write_EEPROM_data(reg_byte_H,reg_byte_L,adc_H,adc_L,max_bit);//write data to eeprom
			if(reg_byte_H==0xFF)//upper_counter for eeprom_address
			{
				if(max_bit==true)
					break;
				max_bit=true;
				reg_byte_H=0x00;
				reg_byte_L=0x00;
			}
			else
			{
				if(reg_byte_L==0xFE)
				{
					reg_byte_H+=0x01;
					reg_byte_L=0x00;
				}
				else
				{
					reg_byte_L+=0x02;
				}
			}
			nrf_delay_ms(5);
			//////////////////////////////////////////////////
			adc_value=adc_start(7);//manually trigger adc
			adc_H=adc_value/256;
			adc_L=adc_value%256;
			printf("ADC7:%d \r\n",adc_value);
			sprintf(adc_string,"3:%d\n",adc_value);
			write_EEPROM_data(reg_byte_H,reg_byte_L,adc_H,adc_L,max_bit);//write data to eeprom
			if(reg_byte_H==0xFF)//upper_counter for eeprom_address
			{
				if(max_bit==true)
					break;
				max_bit=true;
				reg_byte_H=0x00;
				reg_byte_L=0x00;
			}
			else
			{
				if(reg_byte_L==0xFE)
				{
					reg_byte_H+=0x01;
					reg_byte_L=0x00;
				}
				else
				{
					reg_byte_L+=0x02;
				}
			}
			nrf_delay_ms(5);*/
			//////////////////////////////////////////////////
			ble_nus_string_send(&m_nus, adc_string, strlen(adc_string));//send data through ble uart		
			nrf_delay_ms(500);
		}
		//power_manage();// enter into sleep mode,need use gpio interrupt to wake up device
    }
}
